// 考表
export const FAQ_EXAME_ROOM = [
  {
    question: '考表数据准吗？',
    answer: '我们保证只要刷新成功，数据和教务处一致，但具体的考场授课教师可能会另行通知。',
  },
  {
    question: '为什么有些课没有考场？',
    answer: '部分课程没有线下考试，或者授课教师没有录入。',
  },
  {
    question: '我什么时候可以查看我补考考场？',
    answer: '每学期开学前一周左右教务处上的补考考场会全部更新。',
  },
  {
    question: '选修课挂了有补考吗？',
    answer: '一般选修课是没有补考的，但是具体以授课教师通知为准。',
  },
  {
    question: '校选课在哪里考试？',
    answer: '线下通常是最后一节课随堂考，线上请注意授课 APP 的通知，最终还是请以授课教师通知为准。',
  },
];

// 课程成绩
export const FAQ_COURSE_GRADE = [
  {
    question: '单学期 GPA 准吗？',
    answer: [
      '我们不保证单学期 GPA 准确性，我们的数据仅供参考。GPA计算方式详见：',
      {
        text: '福州大学本科生课程考核与成绩记载管理实施办法 （暂行）',
        url: 'https://jwch.fzu.edu.cn/info/1121/11799.htm',
      },
      '。',
    ],
  },
  {
    question: 'APP 内的单学期 GPA是怎么计算的？',
    answer:
      '我们沿用了上述的计算方式，同时不统计以下类型的课程:自然科学与工程技术类、人文社会科学类、经济管理类、文学与艺术类、工程技术类、劳动教育类、创新创业类、通识选修任选。同时，我们只统计主修课程，我们不统计课程类型包含‘二专业’字样的课程。',
  },
  {
    question: '成绩什么时候更新？',
    answer:
      '教务处每学期会提供两次成绩更新时间段，一次是期末考试结束后，一次是补考结束后。大部分课程都会在学期的最后一周时更新完成，具体时间以教务处通知为准。',
  },
  {
    question: 'APP 内的成绩有效吗？',
    answer: '我们保证只要刷新成功，数据和教务处一致，但课程成绩可能会随着时间推移而更新。',
  },
  {
    question: 'APP 提供的内容作为成绩单，会被认可吗？',
    answer: '不会。成绩单需要教务处盖章，除了线下在教务处打印成绩单，你还可以在【校务行】微信小程序打印电子成绩单。',
  },
];
