// 考表
export const FAQ_EXAME_ROOM = [
  {
    question: '考表数据准吗？',
    answer: '我们保证只要刷新成功，数据和教务处一致，但具体的考场授课教师可能会另行通知。',
  },
  {
    question: '为什么有些课没有考场？',
    answer: '部分课程没有线下考试，或者授课教师没有录入',
  },
  {
    question: '我什么时候可以查看我补考考场？',
    answer: '每学期开学前一周左右教务处上的补考考场会全部更新',
  },
  {
    question: '选修课挂了有补考吗？',
    answer: '一般选修课是没有补考的，但是具体以授课教师通知为准',
  },
  {
    question: '校选课在哪里考试？',
    answer: '线下通常是最后一节课随堂考，线上请注意授课 APP 的通知，最终还是请以授课教师通知为准',
  },
];

// 课程成绩
export const FAQ_COURSE_GRADE = [
  {
    question: '单学期 GPA 准吗？',
    answer: '我们不保证单学期 GPA 准确性，我们统计方式详见',
  },
  {
    question: '为什么有些课没有考场？',
    answer: '部分课程没有线下考试，或者授课教师没有录入',
  },
  {
    question: '我什么时候可以查看我补考考场？',
    answer: '每学期开学前一周左右教务处上的补考考场会全部更新',
  },
  {
    question: '选修课挂了有补考吗？',
    answer: '一般选修课是没有补考的，但是具体以授课教师通知为准',
  },
  {
    question: '校选课在哪里考试？',
    answer: '线下通常是最后一节课随堂考，线上请注意授课 APP 的通知，最终还是请以授课教师通知为准',
  },
];
