// 考表
export const FAQ_EXAME_ROOM = [
  {
    question: '考表数据准吗？',
    answer: '我们保证只要刷新成功，数据和教务处一致，但具体的考场授课教师可能会另行通知。',
  },
  {
    question: '为什么有些课没有考场？',
    answer: '部分课程没有线下考试，或者授课教师没有录入。',
  },
  {
    question: '我什么时候可以查看我补考考场？',
    answer: '每学期开学前一周左右教务处上的补考考场会全部更新。',
  },
  {
    question: '选修课挂了有补考吗？',
    answer: '一般选修课是没有补考的，但是具体以授课教师通知为准。',
  },
  {
    question: '校选课在哪里考试？',
    answer: '线下通常是最后一节课随堂考，线上请注意授课 APP 的通知，最终还是请以授课教师通知为准。',
  },
];

// 课程成绩
export const FAQ_COURSE_GRADE = [
  {
    question: '单学期绩点的准确性如何？',
    answer: ['单学期绩点通过学期成绩应用一定的规则计算得到。由于计算规则复杂，我们不保证其准确性，数据仅供参考。'],
  },
  {
    question: 'APP 内的单学期绩点是如何计算的？',
    answer: [
      '我们根据',
      {
        text: '《福州大学本科生课程考核与成绩记载管理实施办法（暂行）》',
        url: 'https://jwch.fzu.edu.cn/info/1172/13460.htm',
      },
      '的规则进行计算，同时不统计校选课课程（自然科学与工程技术类、人文社会科学类、经济管理类、文学与艺术类、工程技术类、劳动教育类、创新创业类、通识选修任选）以及“任意选修”类课程。单学期绩点基于本专业成绩计算，不统计二专业课程。',
    ],
  },
  {
    question: '成绩什么时候更新？',
    answer:
      '教务处每学期有两次成绩更新时间，分别为期末考试结束后、补考结束后。大部分课程都会在学期的最后一周更新完成，具体时间以教务处通知为准。',
  },
  {
    question: 'APP 内的成绩准确性如何？',
    answer: '在线刷新获取到的成绩数据和教务处一致，但课程成绩可能会随着时间推移而更新。',
  },
  {
    question: 'APP 提供的内容作为成绩单，会被认可吗？',
    answer:
      '不会。加盖教务处公章的成绩单方为有效，可在教务处成绩自助打印终端打印纸质成绩单，或在“校务行”微信小程序获取电子成绩单。',
  },
];
